Merge pull request #2 from JohnnyFoulds/development
fix: resolve all code review issues
